In [3]:
import pandas as pd
url = 'https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv'
df = pd.read_csv(url)
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [4]:
df.drop(['PassengerId',	'Name', 'SibSp', 'Parch','Ticket',	'Cabin'	,'Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [11]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male  ...  male  female  male  female  male
0       3  22.0   7.2500       0     1  ...     1       0     1       0     1
1       1  38.0  71.2833       1     0  ...     0       1     0       1     0
2       3  26.0   7.9250       1     0  ...     0       1     0       1     0
3       1  35.0  53.1000       1     0  ...     0       1     0       1     0
4       3  35.0   8.0500       0     1  ...     1       0     1       0     1

[5 rows x 13 columns]

In [14]:
inputs = inputs.loc[:,~inputs.columns.duplicated()]
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [15]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [16]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [18]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [19]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.3)

In [20]:
len(X_train)

623

In [21]:
len(X_test)

268

In [22]:
len(inputs)

891

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [24]:
model.score(X_test,y_test)

0.7686567164179104

In [25]:
y_test[:10]

460    1
44     1
489    1
520    1
404    0
258    1
78     1
29     0
271    1
507    1
Name: Survived, dtype: int64

In [26]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 1, 1, 0, 0, 0, 0])

In [27]:
model.predict_proba(X_test[:10])

array([[9.20735228e-01, 7.92647721e-02],
       [3.55416065e-02, 9.64458393e-01],
       [9.82586264e-01, 1.74137360e-02],
       [8.03409270e-04, 9.99196591e-01],
       [3.64920577e-02, 9.63507942e-01],
       [3.88520023e-35, 1.00000000e+00],
       [9.40829654e-01, 5.91703456e-02],
       [9.90049011e-01, 9.95098944e-03],
       [9.89104363e-01, 1.08956367e-02],
       [9.27455503e-01, 7.25444970e-02]])